//JOBTST      JOB 'ADD COND',
//            ROS.MORALE.RODRIGO,REGION=0M,MSGCLASS=R,
//*           RESTART=ADDCOND,
//*           TYPRUN=SCAN,
//            COND=((08,EQ),(12,EQ),(16,EQ),(888,EQ)),CLASS=A
//*-------------------------------------------------------------------*
//ADDCOND      EXEC CONTCND,PGMVSAM=IEFBR14,
//             AD=ADD,
//             CND='CONDITION',
//             DIA=01,MES=12
//*-------------------------------------------------------------------*
