//JOBCPY      JOB 'IEBGENER COPY FILES',
//            ROS.MORALE,REGION=0M,MSGCLASS=R,
//            COND=((8,EQ),(12,EQ),(16,EQ),(888,EQ)),
//            CLASS=A
//*-------------------------------------------------------------------*
//*     SET PARAMETERS TO JOB   
//*-------------------------------------------------------------------*
// SET  NMFILE='FLNAME',
//      DTFILE='YYYYMMDD'
//*-------------------------------------------------------------------*
//*        FILE SCRATCH
//*-------------------------------------------------------------------*
//SYS000   EXEC PGM=SYS000,
//         PARM=('DS.FILEIN.DYYYYMMDD.SS000101')
//*-------------------------------------------------------------------*
//*        EXECUTE COPY FILE      
//*-------------------------------------------------------------------*
//FILECP   EXEC PGM=IEBGENER
//SYSPRINT DD  DUMMY
//SYSUT1   DD  DSN=DS.&NMFILE.IN.D&DTFILE..SS000101,    *** FILE IN ***
//             DISP=SHR
//SYSUT2   DD  DSN=DS.&NMFILE.OUT.D&DTFILE..SS000101,  *** FILE OUT ***
//             DISP=(,CATLG),LRECL=180,DSORG=PS,RECFM=FB,
//             AVGREC=K,SPACE=(180,(10,1),RLSE)
//*-------------------------------------------------------------------*
